In [1]:
# Dependencies, auxiliary functions etc
import pandas as pd
import numpy as np
from IPython.display import display_html
from IPython.display import display

def display_side_by_side(*args):
    html_str=''
    for df in args:
        html_str+=df.to_html()
    html_str = html_str.replace('table','table style="display:inline; border:0px"')          
    display_html(html_str,raw=True)

<h1>1 Basic DataFrame operations</h1>

<h2>1.1 DataFrame initialization</h2>

In [2]:
# Initialize DataFrame with dummy data and custom indices
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'])
display(df)

         ff        ee        tt       uuu
0  0.488873  0.126088  0.117788  0.878934
1  0.934764  0.219867  0.523409  0.264825
2  0.867725  0.004871  0.502567  0.778153
3  0.790488  0.994675  0.479484  0.355330

In [149]:
# Initialize DataFrame with custom data
data = {'ID': [1, 2, 3],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, columns = ['ID', 'Names', 'Age', 'Values', 'Country'])

# Set one of the columns as index
df2 = df.set_index('ID')
df2.index.name = None # remove index name

# Re-setting index
df3 = df2.copy()
df3.reset_index(inplace = True, drop = True) # drop = True drops denies addition of old index to columns

display_side_by_side(df,df2,df3)

<h2>1.2 Dropping from DataFrame</h2>

In [178]:
data = {'ID': [1, 2, 3, 4, 5, 6]
        ,'Names': ['Kate', 'John', 'Max', 'Mary', 'Pete', 'Miriam']
        ,'Age': [50, 25, 41, 99, 54, 23]
        , 'Values': [3, 4, 8, 4, 3, 4]
        , 'col': [None]}
df_orig = pd.DataFrame(data=data, index = ['a','b','c','d', 'e', 'f'])
df = df_orig.copy()

# Drop columns by column label
df.drop(['Age', 'Names'], axis = 1, inplace = True)

# Drop column by fancy indexing
df.drop(df.columns[0], axis = 1, inplace = True)

# Drop column by ugin del; is directly inplace!
del df['col']

# Drop rows by index label
df.drop(['b'], axis = 0 , inplace = True)

# Drop rows by index number
df.drop(df.index[[0]], axis = 0 , inplace = True)

# Drop rows where value in column does not fulfill condition
df = df[df['Values'] <= 5]

# Drop first n = 1 rows
df.drop(df.head(1).index,inplace=True)

# Drop last n = 1 rows
df.drop(df.tail(1).index,inplace=True) # drop last n rows

display_side_by_side(df_orig,df)

In [10]:
# Drop other columns except those we want to keep
data = {'ID': [1, 2, 3, 4],'Names': ['Kate', 'John', 'Max', 'Mary'],'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4], 'col': [None]}
df_orig = pd.DataFrame(data=data, index = ['a','b','c','d'])
columns_to_keep = ['Names','Values']
df = df[columns_to_keep]
display(df)

  Names  Values
a  Kate       3
b  John       4
c   Max       8
d  Mary       4

<h2>1.3 Slicing data frame</h2>

<h3> 1.3.1 Basic sclicing</h3>

In [8]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])

# Selecting columns
# Using single square brackets selects a Series from DataFrame. 
# Using multiple square brackets selects a slice of data frame (possibly with muliple columns) 
df['ff'] # returns Series
df[['ff']] # returns DataFrame with one column
df[['ff','ee']] # returns DataFrame with two columns
df.loc[:,['ee','tt']]
df.iloc[:,0] # by position in frame

# Selecting rows
df.loc['first'] # by index
df.loc[['first','fourth']] # by index multiple rows
df[0:3]
df.iloc[0:2] # by position in frame

# Using data[2] or data['label'] indexes the series itself, skipping the iloc/loc
# attributes. This is syntatic sugar, but it is safer to use iloc/loc attributes
# explicitly in order avoid confusion querying between index label and index position.

# Example printed out
display_side_by_side(df, df.loc[:,['ee','tt']], df.iloc[0:2])

<h3>1.3.2 Conditional slicing/indexing (boolean masking)</h3>

In [28]:
data = {'ID': [1, 2, 3, 4],'Names': ['Kate', 'John', 'Max', 'Mary'],'Age': [50, 25, 41,99], 'Values': [3, 4, 8,4]}
df = pd.DataFrame(data=data, index = ['a','b','c','d'])

# Get row slice fulfilling a conditions along one column, return with
# certain columns (leave column name empty for all columns)
df2 = pd.DataFrame(df.loc[df['Values'] < 5,  ['Names', 'Values']].copy())

# Same as above but multiple conditions, all columns
df3 = df.loc[(df['Values'] < 5 ) & (df['Names'] == 'John'), ].copy()

# Conditional indexing by preserving original dimensions
df4 = df.where(df['Values'] < 5).copy()

display_side_by_side(df,df2,df3,df4)

<h2>1.4 About chain indexing</h2>

In [19]:
# The rough rule is any time you see back-to-back square brackets,
# ][, you're in asking for trouble. Replace that with a .loc[] or .iloc[]
# and you'll be set. Let's see an example
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
display(df)
print(df['ee']['second']) # bad practice
print(df.loc['second','ee']) # good practice

              ff        ee        tt       uuu
first   0.517347  0.913067  0.196466  0.302559
second  0.716583  0.616392  0.516891  0.338308
third   0.962239  0.765548  0.363047  0.529883
fourth  0.671221  0.046370  0.601396  0.201558

0.616392054791
0.616392054791

In [39]:
# Another example
df = pd.DataFrame()
df['x'] = np.arange(10,14)
df['value'] = np.arange(200,204)
display(df)

print(df[ df['x']== 10 ]['value']) # bad practice
print('-'*30)
print(df.loc[df['x'] == 10, 'value']) # good practice

# The worser option would't even work in the case
# we want to assign a new value for the returned obseravtions

#df[ df['x']== 10 ]['value'] = 1000 # this doesn't work!
print('-'*30)
df.loc[df['x'] == 10, 'value'] = 1000
display(df)

    x  value
0  10    200
1  11    201
2  12    202
3  13    203

0    200
Name: value, dtype: int32
------------------------------
0    200
Name: value, dtype: int32
------------------------------

    x  value
0  10   1000
1  11    201
2  12    202
3  13    203

<h2>1.5 Method chaining</h2>

In [55]:
# The pandorable way is to chain methods operating on DataFrame:
data = {'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 41], 'Weight': [62, 76, 98]}
df = pd.DataFrame(data=data)

# Not-so-good practice
df2 = df.copy()
df2 = df2.drop(df2[df2['Age'] == 25].index)
df2.rename(columns={'Weight': 'Weight (kg)'}, inplace = True)

# Better practice
df3 = df.copy()
df3 = df3.drop(df3[df3['Age'] == 25].index).rename(columns={'Weight': 'Weight (kg)'}).copy()

display_side_by_side(df,df2,df3)

,Age,Names,Weight
0,50,Kate,62
1,25,John,76
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98
,Age,Names,Weight (kg)
0,50,Kate,62
2,41,Max,98

<h1> 2 Hierarchical indexing</h1>

<h2>2.1 Initialize DataFrame with hierarchical indexing</h2>

In [11]:
srs = pd.Series(data=np.random.rand(6), index = [['a','a','a','b','b','c'], [1,2,3] * 2])
display(srs)
srs['b':'c']
srs.loc[:,2]
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,index = [['a','a','b','b',], [1,2] * 2]
                  ,columns = [['col1','col1','col2'], ['ff','gg','ff']])
display_side_by_side(df)

a  1    0.020218
   2    0.832620
   3    0.778157
b  1    0.870012
   2    0.978618
c  3    0.799159
dtype: float64

<h2>2.2 Add second index to existing DataFrame</h2>

In [8]:
df = pd.DataFrame(data = np.arange(12).reshape((4,3))
                  ,columns = ['col1','col1','col2'])
df2 = df.copy()
df2.set_index([df2.index, 'col2'],inplace=True)
df2.index.names = ['Index1', 'Index2']
display_side_by_side(df,df2)

,col1,col1,col2
0,0,1,2
1,3,4,5
2,6,7,8
3,9,10,11
,,col1,col1
Index1,Index2,,
0,2,0,1
1,5,3,4
2,8,6,7
3,11,9,10

<h3>Mappings for data frame columns</h3>

In [31]:
# Mapping from user defined dict
data = {'ID': [1, 2, 3,4],'Names': ['Kate', 'John', 'Max','Kate'],'Age': [50, 25, 41,89], 'Values': [3, 4, 8, 12]}
df = pd.DataFrame(data=data)
age_mapping = {25:0, 41:1, 50:2, 89:3}
df['AgeOrder'] = df['Age'].map(age_mapping)
display(df)

   Age  ID Names  Values  AgeOrder
0   50   1  Kate       3         2
1   25   2  John       4         0
2   41   3   Max       8         1
3   89   4  Kate      12         3

In [7]:
# Map unique column values to index values
d = {key: value for (key, value) in zip(df['Names'].unique(),range(len(df['Names'].unique())))}
df['NameID'] = df['Names'].map(d)
df

   Age  ID Names  Values  AgeOrder  NameID
0   50   1  Kate       3         2       0
1   25   2  John       4         0       1
2   41   3   Max       8         1       2
3   89   4  Kate      12         3       0

<h2>Altering DataFrame values</h2>

In [29]:
df = pd.DataFrame(np.arange(12).reshape(6,2),columns = ['ff', 'er'])
df2 = df.copy()
df2['ff'] *= 0.8
df2['er'] -= 2
display_side_by_side(df,df2)

,ff,er
0,0,1
1,2,3
2,4,5
3,6,7
4,8,9
5,10,11
,ff,er
0,0.0,-1
1,1.6,1
2,3.2,3
3,4.8,5
4,6.4,7
5,8.0,9

<h1>Database-like joins</h1>

In [2]:
# Create date
df = pd.DataFrame(data = np.arange(12).reshape((3,4)), columns = [['col1','col2','col3','col4']])
df2 = pd.DataFrame({'key': [0,1,2], 'vals': [4,6,8]})
display_side_by_side(df,df2)

In [9]:
# Different merges
df3 = pd.merge(df,df2,left_index = True, right_on = 'key',how = 'left')
df4 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'left')
df5 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'right')
df6 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'inner')
df7 = pd.merge(df,df2,left_on = 'col2', right_on = 'key',how = 'outer')

# Right and left joins are basically the same, just different way around
# Compare df8 to df5
df8 = pd.merge(df2,df,left_on = 'key', right_on = 'col2',how = 'left')

display_side_by_side(df3,df4,df5,df6,df7,df8)

,col1,col2,col3,col4,key,vals
0,0,1,2,3,0,4
1,4,5,6,7,1,6
2,8,9,10,11,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1.0,6.0
1,4,5,6,7,NaN,NaN
2,8,9,10,11,NaN,NaN
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1,6
1,NaN,NaN,NaN,NaN,0,4
2,NaN,NaN,NaN,NaN,2,8
,col1,col2,col3,col4,key,vals
0,0,1,2,3,1,6
,col1,col2,col3,col4,key,vals
0,0.0,1.0,2.0,3.0,1.0,6.0
1,4.0,5.0,6.0,7.0,NaN,NaN
2,8.0,9.0,10.0,11.0,NaN,NaN
3,NaN,NaN,NaN,NaN,0.0,4.0
4,NaN,NaN,NaN,NaN,2.0,8.0
,key,vals,col1,col2,col3,col4
0,0,4,NaN,NaN,NaN,NaN
1,1,6,0.0,1.0,2.0,3.0
2,2,8,NaN,NaN,NaN,NaN

<h1>Aggregating infromation in DataFrame</h1>

<h2>Simple means, medians etc.</h2>

In [38]:
# Simple example
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[:2,1] = np.nan
display(df)

# Mean by column, change axis=0 to get rows
display(df.mean(axis=1, skipna=False))
display(df.mean(axis=1, skipna=True))

              ff        ee        tt       uuu
first   0.577229       NaN  0.934214  0.613966
second  0.535633       NaN  0.730122  0.311945
third   0.398221  0.209844  0.186193  0.944372
fourth  0.739551  0.490459  0.227415  0.254356

first          NaN
second         NaN
third     0.434658
fourth    0.427945
dtype: float64

first     0.708470
second    0.525900
third     0.434658
fourth    0.427945
dtype: float64

In [2]:
# Easy way to calculate aggregations using lambdas and apply
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
cols_to_apply = [
                'ff'
                ,'tt'
                ,'uuu']
df2 = pd.DataFrame(df.apply(lambda x: np.max(x[cols_to_apply]) , axis = 1), columns = ['Max of column subset'])
df3 = pd.DataFrame(df.apply(lambda x: np.mean(x[cols_to_apply]) , axis = 1), columns = ['Mean of column subset'])

display_side_by_side(df,df2,df3)

<h2>"Group by" in various forms</h2>

In [15]:
data = {'ID': [1, 1, 2],'Names': ['Kate', 'John', 'Max'],'Age': [50, 25, 40], 'Values': [3, 4, 8]}
df = pd.DataFrame(data=data, index = ['first','second','first'])
df.index.name = 'Index'

result1 = df.groupby(['ID'])['Values'].sum()
result1 = pd.DataFrame(result1)

result2 = df.groupby([df.index])['Age'].mean()
result2 = pd.DataFrame(result2)

result3 = df.groupby([df.index])['Age'].count()
result3 = pd.DataFrame(result3)

display_side_by_side(df, result1,result2,result3)

In [12]:
# Select sum of first greatest N values within group
data = {'ID': [1, 2, 1, 2, 1], 'Values': [3, 9, 8, 7, 3]}
df = pd.DataFrame(data=data)

df2 = df.copy()
df2.sort_values(['ID','Values'],ascending=[True, False],inplace=True)
df2 = df2.groupby('ID').head(2)
df2 = df2.groupby(['ID'])['Values'].sum().sort_values(ascending = False)

df2 = pd.DataFrame(df2)
display_side_by_side(df,df2)

In [25]:
# Combinations of group by and apply: caluclations between grouped columns
# Example: Total price of each product bought
df = pd.DataFrame({'Product': [1, 2, 1, 2],'Quantity': [1, 3, 2, 2], 'Price': [10, 20, 5, 2]})
df2 = pd.DataFrame(df.groupby(['Product']).apply(lambda df,a,b: sum(df[a] * df[b]), 'Quantity', 'Price'))
display_side_by_side(df,df2)

<h2>Agg method</h2>

In [52]:
# Agg is similar to apply, but agg gives the flexibility of
# applying multiple functions at once. Agg() is handy at handling
# DataFrameGroupBy objects compared to apply()
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"score_1":[5,10,15,10]
                   ,"score_2" :[10,15,10,25]
                   ,"score_3" : [10,20,30,40]})

# Mean and sum of "score_2" grouped by "name" and "score_1" columns using apply
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.mean()))
print(df.groupby(["name", "score_1"])["score_2"].apply(lambda x : x.sum()))

# Same with agg(), and even more aggregations applied to multiple columns, all at the same go!
df2 = df.groupby(["name", "score_1"]).agg({"score_2" :[np.mean, np.sum, np.max, np.min], "score_3": [np.mean]}).copy()

# You can also pass in a lambda function to agg
df3 = df.groupby(["name", "score_1"]).agg({ "score_3": lambda x: x.mean()}).copy()

display_side_by_side(df2,df3)

name  score_1
Baar  10         20.0
Foo   5          10.0
      15         10.0
Name: score_2, dtype: float64
name  score_1
Baar  10         40
Foo   5          10
      15         10
Name: score_2, dtype: int64

<h2>Pivot table</h2>

In [63]:
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"name2":['mm','mm','mm','ee']
                   ,"score_1" :[10,15,10,25]
                   ,"score_2" : [10,20,30,40]})
df2 = df.pivot_table(values='score_1', index='name', columns='name2', aggfunc=[np.mean,np.max]).copy()
df3 = df.pivot_table(values='score_1', index='name', columns='name2', aggfunc=[np.mean,np.min], margins=True).copy()
display_side_by_side(df,df2,df3)

<h2>Binning</h2>

In [9]:
df = pd.DataFrame({"name":["Foo", "Baar", "Foo", "Baar"]
                   ,"name2":['mm','mm','mm','ee']
                   ,"score_1" :[10,15,10,25]
                   ,"score_2" : [10,20,30,40]})
df['score_1_bins'] = pd.cut(df['score_1'] , bins = 3)
df['score_1_qbins'] = pd.qcut(df['score_1'], q = 2)
df

   name name2  score_1  score_2   score_1_bins  score_1_qbins
0   Foo    mm       10       10  (9.985, 15.0]  (9.999, 12.5]
1  Baar    mm       15       20  (9.985, 15.0]   (12.5, 25.0]
2   Foo    mm       10       30  (9.985, 15.0]  (9.999, 12.5]
3  Baar    ee       25       40   (20.0, 25.0]   (12.5, 25.0]

<h1>Data cleaning</h1>

<h3>Replace all non-numerical values with NaN</h3>

In [158]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = 'dd'
df.iloc[1,2] = '-----'
df.iloc[2,2] = '#SomeErrorVal'
df2 = df.copy()

cols = ['ff', 'ee','tt','uuu']
for col in cols:
    df2[col][df2.apply(lambda x: np.isreal(x[col]) == True , axis = 1) == False] = np.nan

display_side_by_side(df,df2)

C:\Users\ville_000\Anaconda3\lib\site-packages\ipykernel\__main__.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,ff,ee,tt,uuu
first,0.075799,0.0480505,0.461073,0.014180
second,0.596698,0.951108,-----,0.755430
third,0.278439,dd,#SomeErrorVal,0.546192
fourth,0.163601,0.885995,0.735375,0.605176
,ff,ee,tt,uuu
first,0.075799,0.0480505,0.461073,0.014180
second,0.596698,0.951108,NaN,0.755430
third,0.278439,NaN,NaN,0.546192
fourth,0.163601,0.885995,0.735375,0.605176

<h3>Clean NaN values</h3>

In [24]:
df = pd.DataFrame(np.random.rand(4,4), columns = ['ff', 'ee', 'tt', 'uuu'], index = ['first','second','third','fourth'])
df.iloc[2,1] = np.nan
df.iloc[1,3] = np.nan
df.iloc[0,0] = np.nan
df2 = df.copy()

# Fill NaN by mean of the column
df2['ee'].fillna(df['ee'].mean(), inplace = True)

# Fill using value from previuous row
df2['uuu'].fillna(method='bfill', inplace = True)

# Fill using value from next row
df2['ff'].fillna(method='bfill', inplace = True)

display_side_by_side(df,df2)

,ff,ee,tt,uuu
first,NaN,0.590873,0.574325,0.653201
second,0.652103,0.431418,0.896547,NaN
third,0.435865,NaN,0.806194,0.703889
fourth,0.100227,0.919483,0.714241,0.998847
,ff,ee,tt,uuu
first,0.652103,0.590873,0.574325,0.653201
second,0.652103,0.431418,0.896547,0.703889
third,0.435865,0.647258,0.806194,0.703889
fourth,0.100227,0.919483,0.714241,0.998847

<h1>Data types and scales</h1>

In general, there are 4 types of data scales
<ol>
  <li>Ratio scale, e.g. height</li>
  <li>Inteval scale, e.g. temperature</li>
  <li>Ordinal scale, e.g. grading scale</li>
  <li>Nominal scale, e.g. school names</li>
</ol>

In [41]:
# Specify a column in DataFrame to be gatecorigal, sort by categorical order
df = pd.DataFrame(['E','M','L','M','I','A','B','B','M'],columns = ['Grades'])
# Categories need to be passed in ascending order!
df['Grades'] = df['Grades'].astype('category', categories = ['I','A','B','C','M','E','L'], ordered = True)
df2 = df.sort_values(['Grades'], ascending  = False).copy()
df3 = df[df['Grades'] >= 'M'].copy()
display_side_by_side(df,df2,df3)

,Grades
0,E
1,M
2,L
3,M
4,I
5,A
6,B
7,B
8,M
,Grades
2,L
0,E
8,M
3,M
1,M
7,B
6,B
5,A
4,I
,Grades
0,E
1,M
2,L
3,M
8,M

<h3>get_dummies</h3>

In [51]:
# Use get_dummies to extract dummy columns from gatecorical variable
df = pd.DataFrame(['E','M','L','M','I','A','B','B','M'],columns = ['Grades'])
df['Grades'] = df['Grades'].astype('category', categories = ['I','A','B','C','M','E','L'], ordered = True)
df['values'] = np.random.rand(9)
df = pd.get_dummies(df, prefix=['Grades'])
df

,values,Grades_I,Grades_A,Grades_B,Grades_C,Grades_M,Grades_E,Grades_L
0,0.008691,0,0,0,0,0,1,0
1,0.608590,0,0,0,0,1,0,0
2,0.330662,0,0,0,0,0,0,1
3,0.501051,0,0,0,0,1,0,0
4,0.725900,1,0,0,0,0,0,0
5,0.855261,0,1,0,0,0,0,0
6,0.629694,0,0,1,0,0,0,0
7,0.175949,0,0,1,0,0,0,0
8,0.506403,0,0,0,0,1,0,0

<h1>Times and dates</h1>

Pandas use 4 types of time functionalities
<ol>
  <li>Timestamp: a point in time</li>
  <li>Period: period spanning over time range</li>
  <li>DatetimeIndex</li>
  <li>PeriodIndex</li>
</ol>

<b> It is recommended to use yyyy-mm-dd convetion for dates!</b> This avoids the danger misinterpretation of months vs. days.

In [34]:
# Both of these create a TimeStamp, but only latter accepts frontward European convention!
display(pd.Timestamp('2008-12-10'))
display(pd.to_datetime('10-12-2008', dayfirst = True, format = '%d-%m-%Y')) # only to_datime has dayfirst option!

Timestamp('2008-12-10 00:00:00')

Timestamp('2008-12-10 00:00:00')

In [98]:
# Examples of periods
display(pd.Period('2013'))
display(pd.Period('2017Q1'))
display(pd.Period('05/2017'))
display(pd.Period('2017-12-10'))

Period('2013', 'A-DEC')

Period('2017Q1', 'Q-DEC')

Period('2017-05', 'M')

Period('2017-12-10', 'D')

In [132]:
# TimeStamp and Period indices in DataFrames
df1 = pd.DataFrame(np.arange(3), [pd.Timestamp('2008-12-10'),pd.Timestamp('2008-12-11'),pd.Timestamp('2008-12-12')])
df2 = pd.DataFrame(np.arange(3), [pd.Period('2008-12-10'),pd.Period('2008-12-11'),pd.Period('2008-12-12')])
df3 = pd.DataFrame(np.arange(3), [pd.Period('2008Q2'),pd.Period('2008Q3'),pd.Period('2008Q4')])
df4 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='1D'))
df5 = pd.DataFrame(np.arange(4), pd.date_range('2016-10-01', periods=4, freq='3W-SUN')) #SUN specifies we want only sundays
display_side_by_side(df1,df2,df3,df4,df5)

,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008-12-10,0
2008-12-11,1
2008-12-12,2
,0
2008Q2,0
2008Q3,1
2008Q4,2
,0
2016-10-01,0
2016-10-02,1
2016-10-03,2
2016-10-04,3
,0
2016-10-02,0
2016-10-23,1
2016-11-13,2
2016-12-04,3

In [32]:
# Convert column into a PeriodIndex
df = pd.DataFrame({'Quarter': ['2008-01-01','2008-04-01','2008-07-01'], 'Values': [5,3,8]})
df2 = pd.DataFrame()
df2['Values'] = df['Values']
df2.index = pd.PeriodIndex(df['Quarter'], freq = '1Q')
df2.index.name = None

df3 = pd.DataFrame({'Year': ['2008','2009','2010'], 'Values': [5,3,8]})
df4 = pd.DataFrame()
df4['Values'] = df3['Values']
df4.index = pd.PeriodIndex(df3['Year'], freq = '1A')
df4.index.name = None

display_side_by_side(df,df2,df3,df4)

In [110]:
#TimeDelta is the difference between two TimeStamps
display(pd.Timestamp('2008-12-10') - pd.Timestamp('2009-04-10'))

Timedelta('-121 days +00:00:00')

<h1>Time series magic for DataFrames</h1>

In [144]:
# Start indexing ffrom Thursday 2009-10-01
df = pd.DataFrame({'Values': np.random.randn(8).cumsum()}
                  ,index = pd.date_range('2009-10-01', periods=8, freq='1W-THU'))

# Nth differences
df2 = df.diff(2).copy()

# Resample to monthly by mean (or sum, min, max)
df3 = df.resample('M').mean().copy()

# Slice DataFrame to only include observations between some range
df4 = df['2009-10-09':'2009-11-07'].copy()

# Change frequency
df5 = df.asfreq('2W-THU').copy()

display_side_by_side(df,df2, df3,df4,df5)

,Values
2009-10-01,1.417639
2009-10-08,1.880599
2009-10-15,1.687781
2009-10-22,0.470321
2009-10-29,-0.195761
2009-11-05,2.369993
2009-11-12,2.618214
2009-11-19,2.572185
,Values
2009-10-01,NaN
2009-10-08,NaN
2009-10-15,0.270141
2009-10-22,-1.410278
2009-10-29,-1.883542
2009-11-05,1.899672
2009-11-12,2.813975
2009-11-19,0.202191
,Values
2009-10-31,1.052116
2009-11-30,2.520131
,Values
2009-10-15,1.687781
2009-10-22,0.470321
2009-10-29,-0.195761
2009-11-05,2.369993
,Values
2009-10-01,1.417639
2009-10-15,1.687781
2009-10-29,-0.195761
2009-11-12,2.618214

<h3>Import Excel file</h3>

In [13]:
# Example applies to Windows
import pandas as pd
import os
path = r'C:\myfolder'
file = 'myfile.xlsx'
df = pd.read_excel(os.path.join(path,file))
df = pd.read_excel(os.path.join(path,file), sheet_name = 'data', skiprows = 16, parse_cols = ("A,C:F"))

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\myfolder\\myfile.xlsx'